tutorials/incompressible/icoDyMFoam/movingBlockRBF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // Back
    (-12.5 -12.5 -0.1)
    (-2.5 -12.5 -0.1)
    (-2.5 -0.5 -0.1)
    (-12.5 -0.5 -0.1)

    (2.5 -12.5 -0.1)
    (2.5 -0.5 -0.1)

    (12.5 -12.5 -0.1)
    (12.5 -0.5 -0.1)

    (12.5 0.5 -0.1)
    (2.5 0.5 -0.1)

    (12.5 12.5 -0.1)
    (2.5 12.5 -0.1)

    (-2.5 0.5 -0.1)
    (-2.5 12.5 -0.1)

    (-12.5 0.5 -0.1)
    (-12.5 12.5 -0.1)

    // Front
    (-12.5 -12.5 0.1)
    (-2.5 -12.5 0.1)
    (-2.5 -0.5 0.1)
    (-12.5 -0.5 0.1)

    (2.5 -12.5 0.1)
    (2.5 -0.5 0.1)

    (12.5 -12.5 0.1)
    (12.5 -0.5 0.1)

    (12.5 0.5 0.1)
    (2.5 0.5 0.1)

    (12.5 12.5 0.1)
    (2.5 12.5 0.1)

    (-2.5 0.5 0.1)
    (-2.5 12.5 0.1)

    (-12.5 0.5 0.1)
    (-12.5 12.5 0.1)

);

blocks
(
    hex (0 1 2 3 16 17 18 19) (10 12 1) simpleGrading (1 1 1)
    hex (1 4 5 2 17 20 21 18) (5 12 1) simpleGrading (1 1 1)
    hex (4 6 7 5 20 22 23 21) (10 12 1) simpleGrading (1 1 1)
    hex (5 7 8 9 21 23 24 25) (10 1 1) simpleGrading (1 1 1)
    hex (9 8 10 11 25 24 26 27) (10 12 1) simpleGrading (1 1 1)
    hex (12 9 11 13 28 25 27 29) (5 12 1) simpleGrading (1 1 1)
    hex (14 12 13 15 30 28 29 31) (10 12 1) simpleGrading (1 1 1)
    hex (3 2 12 14 19 18 28 30) (10 1 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall block
    (
        (2 5 21 18)
        (5 21 25 9)
        (9 25 28 12)
        (12 28 18 2)
    )

    patch top
    (
        (15 13 29 31)
        (13 11 27 29)
        (11 10 26 27)
    )

    wall bottom
    (
        (0 1 17 16)
        (1 4 20 17)
        (4 6 22 20)
    )

    wall left
    (
        (0 16 19 3)
        (3 19 30 14)
        (14 30 31 15)
    )

    wall right
    (
        (6 22 23 7)
        (7 23 24 8)
        (8 24 26 10)
    )

    empty frontAndBack
    (
        (0 1 2 3)
        (1 4 5 2)
        (4 6 7 5)
        (5 7 8 9)
        (9 8 10 11)
        (12 9 11 13)
        (14 12 13 15)
        (3 2 12 14)

        (16 17 18 19)
        (17 20 21 18)
        (20 22 23 21)
        (21 23 24 25)
        (25 24 26 27)
        (28 25 27 29)
        (30 28 29 31)
        (19 18 28 30)
    )

);

mergePatchPairs
(
);

// ************************************************************************* //
